# H_work
Домашнее задание по курсу "**Итоги блока**"

1. Создаем репозиторий https://github.com/Yerke-lab/home_work_1.git

2. в https://www.draw.io/ рисуем блок схему решения задачи

3. Снабжаем репозиторий оформленным текстовым описанием решения 

4. Пишем программу, решающую поставленную задачу на языке **#C**

5. Используем контроль версий в работе над этоим проектом (минимум 2 - 4 коммитов)

*ЗАДАЧА:* Написать программу, которая из имеющегося массива строк формирует массив из строк,длина которых меньше либо равна 3 символа. Первоначальный массив ввести с клавиатуры, либо задать на старте выполнения алгоритма. При решении не рекомендуется пользоваться коллекциями, лучше обойтись исключительное массивами.

**Решение**

string[] M;

            Console.WriteLine("Введите массив строк через пробел");

            string stroka = Console.ReadLine();

            M = stroka.Split(' ');

            var result = new string[M .Length];

            var realSize = 0;

            foreach (var value in M )
            {
                if (value.Length <= 3)
                {
                    result[realSize] = value;

                    realSize++;
                }
            }
            Console.WriteLine(string.Join(Environment.NewLine, result, 0, realSize));
            
            Console.ReadKey(true);